Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/OmegaT_ESP32-level2.tmx
Source language: en_us
Languages: it_it

source: At the beginning of the code, we define two variables to store the pin numbers for the LEDs-GPIO 4 and GPIO 5-and two more variables to keep track of whether each LED is currently ON or OFF.
it_it: All'inizio del codice, definiamo due variabili per memorizzare i numeri dei pin dei LED - GPIO 4 e GPIO 5 - e altre due variabili per tenere traccia dello stato di ciascun LED, ovvero se è acceso o spento.

source: At the same time, the Serial Monitor will show “LED1 Status: ON”.
it_it: Contemporaneamente, il Monitor Seriale mostrerà “LED1 Status: ON”.

source: At the same time, you can keep an eye on the Serial Monitor to see which clients are connecting to and disconnecting from the ESP32.
it_it: Allo stesso tempo, si può tenere d'occhio il Monitor Seriale per vedere quali client si connettono e si disconnettono dall'ESP32.

source: At the top of the sketch, we include two extra libraries.
it_it: Nella parte superiore dello sketch, includiamo due librerie aggiuntive.

source: Attributes are the information actually transferred between BLE devices.
it_it: Gli attributi sono le informazioni effettivamente trasferite tra dispositivi BLE.

source: Auto Page Refresh
it_it: Aggiornamento Automatico della Pagina

source: Automatic updates are not supported in this region, as they target the default package without the "-cn" suffix, resulting in download failures.
it_it: Gli aggiornamenti automatici non sono supportati in questa regione, poiché hanno come target il pacchetto di default senza il suffisso "-cn", causando errori di download.

source: BLE devices can also switch between standby and active modes much faster than classic Bluetooth devices, saving even more power.
it_it: I dispositivi BLE possono anche passare dalla modalità standby a quella attiva molto più velocemente rispetto ai dispositivi Bluetooth classici, risparmiando ancora più energia.

source: BLE is designed for devices that send small amounts of data infrequently and operate on small batteries.
it_it: BLE è progettato per dispositivi che inviano piccole quantità di dati raramente e funzionano con batterie di piccole dimensioni.

source: BLE is primarily used to save power, but there are actually several important differences.
it_it: Il BLE viene utilizzato principalmente per risparmiare energia, ma in realtà ci sono differenze importanti.

source: BLE operates in the same radio spectrum range as Bluetooth Classic, but uses a different set of 40 channels at a lower data rate (up to 1 Mbps).
it_it: BLE opera nello stesso spettro radio di Bluetooth Classic, ma utilizza un diverso set di 40 canali a una velocità di trasmissione dati inferiore (fino a 1 Mbps).

source: Based on the received message, we need to take appropriate action.
it_it: In base al messaggio ricevuto, dobbiamo intraprendere l'azione appropriata.

source: Basic Example: Blink
it_it: Esempio base: Blink

source: Basically, the Bluetooth protocol stack is split into two parts: a “host stack” and a “controller stack”.
it_it: In pratica, lo stack del protocollo Bluetooth è suddiviso in due parti: uno "stack host" e uno "stack controller".

source: Basics of Bluetooth Low Energy
it_it: Nozioni di Base su Bluetooth Low Energy

source: Be aware when choosing which pins to use.
it_it: Fare attenzione quando si sceglie quali pin utilizzare.

source: Be sure to search for a similar reported issue.
it_it: Assicurarsi di cercare un problema segnalato simile.

source: Because of its immense popularity, this is the best board for beginners.
it_it: Grazie alla sua immensa popolarità, questa è la scheda migliore per i principianti.

source: Because of the low-noise design and high sensitivity of the circuit, relatively small pads can be made.
it_it: Grazie al design a basso rumore e all'elevata sensibilità del circuito, è possibile realizzare touchpad relativamente piccoli.

source: Because the ESP32’s operating voltage range is 2.2V to 3.6V, the board includes an LDO voltage regulator to keep the voltage stable at 3.3V.
it_it: Poiché l'intervallo di tensione operativa dell'ESP32 è compreso tra 2,2 V e 3,6 V, la scheda include un regolatore di tensione LDO per mantenere la tensione stabile a 3,3 V.

source: Before Installing
it_it: Prima di Installare

source: Before continuing, we must be clear that this project is supported by `Espressif Systems`_ and the community.
it_it: Prima di continuare, è importante chiarire che questo progetto è supportato da `Espressif Systems`_ e dalla community.

source: Before opening a new issue, please read this:
it_it: Prima di aprire una nuova segnalazione, leggere quanto segue:

source: Before we proceed, it’s important to understand the Bluetooth protocol stack.
it_it: Prima di procedere, è importante comprendere lo stack del protocollo Bluetooth.

source: Before you begin, please make sure that you have the following software installed:
it_it: Prima di iniziare, assicurarsi di aver installato il seguente software:

source: Before you can use the Arduino IDE to program the ESP32, you must first install the ESP32 board (also known as the ESP32 Arduino Core) via the Arduino Board Manager.
it_it: Prima di poter utilizzare l'IDE Arduino per programmare l'ESP32, è necessario installare la scheda ESP32 (nota anche come ESP32 Arduino Core) tramite Arduino Board Manager.

source: Before you upload the code to your ESP32, you may want to change two things: choose a network name (SSID) and a password that the ESP32 will use to create its Wi-Fi network.
it_it: Prima di caricare il codice sull'ESP32, si devono modificare due cose: scegliere un nome di rete (SSID) e una password che l'ESP32 utilizzerà per creare la sua rete Wi-Fi.

source: Below is a comparison of the peripheral interfaces provided by the ESP8266 and the ESP32:
it_it: Di seguito è riportato un confronto tra le interfacce periferiche fornite da ESP8266 ed ESP32:

source: Below you’ll find the complete code for this project.
it_it: Di seguito si trova il codice completo per questo progetto.

source: Between the <body> tags is the actual web page content.
it_it: Tra i tag ><body> si trova il contenuto effettivo della pagina web.

source: Between the <style> tags is the CSS code used to style the web page.
it_it: Tra i tag <style> si trova il codice CSS utilizzato per definire lo stile della pagina web.

source: Binary file is exported to the same Directory where your code is present
it_it: Il file binario viene esportato nella stessa Directory in cui si trova il codice.

source: Blue LED - User Programmable
it_it: LED blu - Programmabile dall'utente

source: Bluetooth Classic is designed for continuous two-way data transfer with high application throughput (up to 3 Mbps); highly effective, but only for short distances.
it_it: Il Bluetooth Classic è progettato per il trasferimento dati bidirezionale continuo con un'elevata velocità di trasmissione (fino a 3 Mbps); altamente efficace, ma solo per brevi distanze.

source: Bluetooth LE, originally marketed as Bluetooth Smart and commonly referred to as just BLE, is designed for very low power operation while maintaining a similar communication range.
it_it: Bluetooth LE, originariamente commercializzato come Bluetooth Smart e comunemente noto semplicemente come BLE, è progettato per funzionare a bassissimo consumo energetico mantenendo un raggio di comunicazione simile.

source: Bluetooth Low Energy (BLE) is everywhere these days.
it_it: Bluetooth Low Energy (BLE) è ormai onnipresente.

source: Bluetooth Low Energy (BLE), sometimes referred to as “Bluetooth Smart,” is a light-weight subset of classic Bluetooth introduced as part of the Bluetooth 4.0 core specification.
it_it: Bluetooth Low Energy (BLE), a volte indicato come "Bluetooth Smart", è un sottoinsieme leggero del Bluetooth classico introdotto come parte delle specifiche principali di Bluetooth 4.0.

source: Bluetooth Profiles
it_it: Profili Bluetooth

source: Bluetooth Serial Sketch
it_it: Sketch Bluetooth Serial

source: Bluetooth profiles are additional protocols that build upon the basic Bluetooth standard.
it_it: I profili Bluetooth sono protocolli aggiuntivi che si basano sullo standard Bluetooth di base.

source: Bluetooth v4.2 BR/EDR and BLE specification
it_it: Specifiche Bluetooth v4.2 BR/EDR e BLE

source: Boot - Download new programs
it_it: Boot - Scarica nuovi programmi

source: Booting Mode
it_it: Modalità di Boot

source: Both are well-known microcontrollers, and for good reason.
it_it: Entrambi sono microcontrollori ben noti, e per una buona ragione.

source: Both boards have advanced power-saving technologies to minimize power consumption effectively.
it_it: Entrambe le schede sono dotate di tecnologie avanzate di risparmio energetico per ridurre al minimo il consumo energetico.

source: Both microcontrollers support Wi-Fi, but the ESP32 includes extra features such as Wi-Fi Direct.
it_it: Entrambi i microcontrollori supportano il Wi-Fi, ma l'ESP32 include funzionalità aggiuntive come il Wi-Fi Direct.

source: Both the ESP8266 and ESP32 are supported by the Arduino IDE and the native ESP-IDF (Espressif IoT Development Framework).
it_it: Sia l'ESP8266 che l'ESP32 sono supportati dall'IDE Arduino e dal framework nativo ESP-IDF (Espressif IoT Development Framework).

source: Built around ESP32 series of SoCs
it_it: Costruita sulla serie di SoC ESP32

source: Built around ESP32-C3 series of SoCs, RISC-V single-core microprocessor
it_it: Costruito sulla serie di SoC ESP32-C3, microprocessore single-core RISC-V

source: Built-in OV2640 2MP camera and microSD card slot make this one of the most interesting boards available; it’s ideal for IoT projects that require a camera with advanced functions like image tracking and recognition.
it_it: La fotocamera OV2640 da 2 MP integrata e lo slot per schede microSD rendono questa una delle schede più interessanti disponibili; è ideale per progetti IoT che richiedono una fotocamera con funzioni avanzate come il tracciamento e il riconoscimento delle immagini.

source: Built-in Sensors
it_it: Sensori Integrati

source: But before uploading the sketch to the ESP32, you’ll need to change two things in the code-your Wi-Fi network name (SSID) and your Wi-Fi password.
it_it: Ma prima di caricare lo sketch sull'ESP32, si dovranno modificare due cose nel codice: il nome della rete Wi-Fi (SSID) e la password.

source: But before you upload the code, you need to make one essential modification.
it_it: Ma prima di caricare il codice, è necessario apportare una modifica essenziale.

source: But computers don’t use regular language-they follow a set of special rules called HTTP, which stands for HyperText Transfer Protocol.
it_it: Ma i computer non usano un linguaggio normale: seguono una serie di regole speciali chiamate HTTP, acronimo di HyperText Transfer Protocol.

source: But how do you determine which one is better suited for your project?
it_it: Ma come si fa a stabilire quale sia il più adatto?

source: But in this example, instead of just displaying data, we’re actually controlling LEDs through the web interface.
it_it: Ma in questo esempio, invece di visualizzare semplicemente i dati, stiamo effettivamente controllando i LED tramite l'interfaccia web.

source: But now, we also set up a bunch of new rules!
it_it: Ma ora, abbiamo anche impostato un sacco di nuove regole!

source: But this doesn’t mean the ESP32 is a better choice in every case.
it_it: Ma questo non significa che l'ESP32 sia la scelta migliore in ogni caso.

source: But what if someone accidentally types in a wrong or random web address that doesn’t exist?
it_it: Ma cosa succede se qualcuno digita accidentalmente un indirizzo web errato o casuale che non esiste?

source: But what if you want it to update automatically and more often?
it_it: Ma cosa succede se si desidera che si aggiorni automaticamente e più spesso?

source: By default, it’s called ESP32test , but you can rename it and give it a unique name.
it_it: Per default, si chiama ESP32test , ma è possibile rinominarlo e assegnargli un nome univoco.

source: Bytes (inside the system RAM)
it_it: Byte (all'interno della RAM di sistema)

source: CAN Interface
it_it: Interfaccia CAN

source: CP2102 USB-to-UART converter
it_it: Convertitore USB-UART CP2102

source: Capacitive Touch Sensor
it_it: Sensore Touch Capacitivo

source: Central devices are usually devices with far more processing power and memory, such as mobile phones or tablets, to which you connect.
it_it: I dispositivi Centrali sono solitamente dispositivi con una potenza di elaborazione e una memoria molto maggiori, come telefoni cellulari o tablet, a cui ci si connette.

source: Channels with 1 MHz spacing
it_it: Canali con spaziatura di 1 MHz

source: Channels with 2 MHz spacing
it_it: Canali con spaziatura di 2 MHz

source: Characteristics
it_it: Caratteristiche

source: Click ``Clone`` to start cloning the repository
it_it: Cliccare su ``Clone`` per iniziare a clonare il repository

source: Click on it!
it_it: Cliccarvi sopra!

source: Click on that entry, and then choose Install.
it_it: Cliccare su quella voce e poi selezionare "Install".

source: Click on the toggle switch to toggle the LED.
it_it: Cliccare sullo switch per attivare/disattivare il LED.

source: Click the Install button to add it to your Arduino IDE.
it_it: Cliccare sul pulsante "Install" per aggiungerla all'IDE di Arduino.

source: Click the links below to download the libraries.
it_it: Cliccare sui link sottostanti per scaricare le librerie.

source: Clock Speed
it_it: Velocità del Clock

source: Code Explanation
it_it: Spiegazione del Codice

source: Code Explanation:
it_it: Spiegazione del Codice:

source: Command ``$ sudo dnf -y install arduino`` will most likely install an older release.
it_it: Il comando ``$ sudo dnf -y install arduino`` molto probabilmente installerà una versione precedente.

source: Communication Range
it_it: Portata della Comunicazione

source: Compared to the previous board, this one includes an OLED display, making it a neat addition for Internet of Things applications.
it_it: Rispetto alla scheda precedente, questa include un display OLED, il che la rende un'aggiunta interessante per le applicazioni Internet of Things..

source: Compatibility: Bluetooth Classic is more prevalent in older devices, while BLE is commonly used in modern smartphones and other gadgets.
it_it: Compatibilità: il Bluetooth Classic è più diffuso nei dispositivi più datati, mentre il BLE è comunemente utilizzato negli smartphone e in altri dispositivi moderni.

source: Compile and upload (You might need to hold the boot button while uploading)
it_it: Compilare e caricare (potrebbe essere necessario tenere premuto il pulsante di boot durante l'uploading)

source: Congratulations!
it_it: Congratulazioni!

source: Connect the relay module to the ESP32 as depicted in the following diagram.
it_it: Collegare il modulo relè all'ESP32 come illustrato nello schema seguente.

source: Connect to this network using the password you set in the code (the default in this example is “12345678”).
it_it: Ci si connette a questa rete utilizzando la password che impostata nel codice (quella predefinita in questo esempio è "12345678").

source: Connected to Flash memory
it_it: Connesso alla memoria Flash

source: Connecting the DS18B20 sensor to your ESP32 is simple.
it_it: Collegare il sensore DS18B20 all'ESP32 è semplice.

source: Connecting to the Android Phone
it_it: Connessione al Telefono Android

source: Constantly pressing the refresh button isn’t practical.
it_it: Premere costantemente il pulsante di aggiornamento non è pratico.

source: Contents:
it_it: Contenuti:

source: Contributing
it_it: Contribuire

source: Copy the code below to your Arduino IDE.
it_it: Copiare il codice qui sotto nell'IDE Arduino.

source: Create A Simple ESP32 Web Server In Arduino IDE
it_it: Creare un Semplice Server Web ESP32 nell'IDE Arduino

source: Creating the Web Page
it_it: Creazione della Pagina web

source: Cue the band and light the fireworks.
it_it: Suoniamo la band e accendiamo i fuochi d'artificio.

source: DAC Channels The ESP32 includes two 8-bit DAC channels for converting digital signals to true analog voltages.
it_it: Canali DAC L'ESP32 include due canali DAC a 8 bit per convertire i segnali digitali in tensioni analogiche.

source: Data Rate
it_it: Velocità Dati

source: Data Transfer Rates: Bluetooth Classic provides higher data rates than BLE, making it suitable for projects that require continuous and high-speed data transmission, while BLE is optimized for short bursts of data transmission.
it_it: Velocità di Trasferimento Dati: Il Bluetooth Classic offre velocità di trasferimento dati più elevate rispetto al BLE, rendendolo adatto a progetti che richiedono una trasmissione dati continua e ad alta velocità, mentre il BLE è ottimizzato per brevi raffiche di trasmissione dati.

source: Data is sent in the same way (using Gaussian Frequency Shift Keying), but the speed of data transmission is lower-a maximum of 1 Mb/s, compared to the 24 Mb/s maximum of classic Bluetooth.
it_it: I dati vengono inviati allo stesso modo (utilizzando la tecnologia Gaussian Frequency Shift Keying), ma la velocità di trasmissione è inferiore: un massimo di 1 Mb/s, rispetto ai 24 Mb/s del Bluetooth classico.

source: Defining Constants and Variables
it_it: Definizione di Costanti e Variabili

source: Demonstration
it_it: Dimostrazione

source: Depending on the design, you may need to install additional drivers for your USB-to-serial converter before you are able to upload code to your ESP32.
it_it: A seconda del progetto, potrebbe essere necessario installare driver aggiuntivi per il convertitore USB-seriale prima di poter caricare il codice sull'ESP32.

source: Depending on the state of these pins, the ESP32 will enter BOOT mode or FLASH mode at power on.
it_it: A seconda dello stato di questi pin, l'ESP32 entrerà in modalità BOOT o FLASH all'accensione.

source: Depending on where you’re buying from, you can generally find both boards for sale at more or less the same price.
it_it: A seconda del luogo di acquisto, è generalmente possibile trovare entrambe le schede in vendita più o meno allo stesso prezzo.

source: Descriptor: provides additional information or configuration options for the characteristic.
it_it: Descrittore: fornisce informazioni aggiuntive o opzioni di configurazione per la caratteristica.

source: Detailed Code Explanation
it_it: Spiegazione Dettagliata del Codice

source: Development
it_it: Sviluppo

source: Development Boards
it_it: Schede di Sviluppo

source: Development release link::
it_it: Link alla versione in fase di sviluppo::

source: Device Pairing is Mandatory?
it_it: L'associazione del Dispositivo è Obbligatoria?

source: Digital interfaces:
it_it: Interfacce digitali:

source: Displaying the HTML Web Page
it_it: Visualizzazione della pagina web HTML

source: Displaying the Visitor Counter
it_it: Visualizzazione del Contatore Visitatori

source: Displays
it_it: Display

source: Don't Care
it_it: Non importa

source: Don’t get intimidated by the technical term; think of HTTP as simply the set of rules that computers follow when sharing websites with each other.
it_it: Non lasciarsi intimidire dal termine tecnico; si pensi all'HTTP semplicemente come all'insieme di regole che i computer seguono quando condividono siti web tra loro.

source: Don’t have WiFi?
it_it: Non hai il Wi-Fi?

source: Don’t worry if you have a different board; the information on this page should still be useful.
it_it: Non c'è da preoccuparsi se si ha una scheda diversa; le informazioni in questa pagina dovrebbero comunque essere utili.

source: Download and install Git from [git-scm.com](https://git-scm.com/download/win)
it_it: Scaricare e installare Git da [git-scm.com](https://git-scm.com/download/win)

source: Download and install the latest Arduino IDE ``Windows Installer`` from [arduino.cc](https://www.arduino.cc/en/Main/Software)
it_it: Scaricare e installare l'ultima versione di Arduino IDE ``Windows Installer`` da [arduino.cc](https://www.arduino.cc/en/Main/Software)

source: Dual-core Processor
it_it: Processore Dual-core

source: Dual-mode Bluetooth Capabilities
it_it: Funzionalità Bluetooth Dual-Mode

source: Due to its lower power consumption in active mode, the ESP8266 is better suited for simple, low-power projects powered by a battery pack.
it_it: Grazie al suo ridotto consumo energetico in modalità attiva, l'ESP8266 è più adatto a progetti semplici e a basso consumo, alimentati da una batteria.

source: During the chip's system reset, the latches of the strapping pins sample the voltage level as strapping bits, and hold these bits until the chip is powered down or shut down.
it_it: Durante il reset del sistema del chip, i latch dei pin di strapping campionano il livello di tensione come bit di strapping e li mantengono fino allo spegnimento o allo spegnimento del chip.

source: Dynamically Loading Sensor Data with AJAX
it_it: Caricamento Dinamico dei Dati dei Sensori con AJAX

source: EN - Reset the ESP32 chip
it_it: EN - Resetta il chip ESP32

source: EN Pin is used to enable the ESP32.
it_it: Il pin EN viene utilizzato per abilitare l'ESP32.

source: ESP-IDF currently supports two host stacks.
it_it: ESP-IDF supporta attualmente due stack host.

source: ESP-WROOM-32 Chip
it_it: Chip ESP-WROOM-32

source: ESP-WROOM-32 Module
it_it: Modulo ESP-WROOM-32

source: ESP32 ADC Pins
it_it: Pin ADC dell'ESP32

source: ESP32 Basics
it_it: Nozioni di Base su ESP32

source: ESP32 Basics: Bluetooth Classic
it_it: Nozioni di base su ESP32: Bluetooth Classic

source: ESP32 Basics: Bluetooth Low Energy (BLE)
it_it: Nozioni di Base su ESP32: Bluetooth Low Energy (BLE)

source: ESP32 Bluetooth Protocol Stack
it_it: Stack del Protocollo Bluetooth ESP32

source: ESP32 Board.
it_it: Board ESP32.

source: ESP32 Code
it_it: Codice ESP32

source: ESP32 DAC Pins
it_it: Pin DAC dell'ESP32

source: ESP32 DevKit V1 Board Hardware Overview
it_it: Panoramica hardware della scheda ESP32 DevKit V1

source: ESP32 Development Board Pinout
it_it: Pinout della Scheda di Sviluppo ESP32

source: ESP32 Development Boards
it_it: Schede di Sviluppo ESP32

source: ESP32 Development Platforms
it_it: Piattaforme di Sviluppo ESP32

source: ESP32 Enable Pin
it_it: Pin di abilitazione ESP32

source: ESP32 Example Sketches
it_it: Sketch di Esempio per ESP32

source: ESP32 Example: WiFi Scan
it_it: Esempio ESP32: Scansione WiFi

source: ESP32 GPIO Pins
it_it: Pin GPIO dell'ESP32

source: ESP32 I2C Pins
it_it: Pin I2C dell'ESP32

source: ESP32 Interrupt Pins
it_it: Pin di Interrupt ESP32

source: ESP32 OLED Kit
it_it: Kit ESP32 OLED

source: ESP32 Operating Modes
it_it: Modalità Operative dell'ESP32

source: ESP32 PWM Pins
it_it: Pin PWM ESP32

source: ESP32 Peripherals and I/O
it_it: Periferiche e I/O ESP32

source: ESP32 Pinout
it_it: Pinout ESP32

source: ESP32 Power Pins
it_it: Pin di alimentazione ESP32

source: ESP32 Project: Bluetooth-Controlled Relay
it_it: Progetto ESP32: Relè Controllato Tramite Bluetooth

source: ESP32 Projects
it_it: Progetti ESP32

source: ESP32 RTC GPIO Pins
it_it: Pin GPIO RTC dell'ESP32

source: ESP32 SPI Pins
it_it: Pin SPI dell'ESP32

source: ESP32 Strapping Pins
it_it: Pin di Strapping dell'ESP32

source: ESP32 Touch Pins
it_it: Pin touch dell'ESP32

source: ESP32 UART Pins
it_it: Pin UART ESP32

source: ESP32 clearly wins most match ups, but it falls behind in simplicity and power efficiency.
it_it: L'ESP32 vince chiaramente la maggior parte dei confronti, ma è inferiore in termini di semplicità ed efficienza energetica.

source: ESP32 features three SPIs (SPI, HSPI, and VSPI) in slave and master modes.
it_it: L'ESP32 è dotato di tre SPI (SPI, HSPI e VSPI) in modalità slave e master.
